app/controllers/home_controller.rb

  def index
    @users = User.all
    @photos = Photo.all
---
SELECT "users".* FROM "users"
SELECT "photos".* FROM "photos"