app/controllers/photos_controller.rb

  def create
    @photo = current_user.photos.create( photo_params )
---
INSERT INTO "photos" ("photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at", "name", "caption", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"